; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	infrared3 - mode
	image2 - mode
	image0 - mode
	image1 - mode
	infrared6 - mode
	spectrograph4 - mode
	infrared7 - mode
	spectrograph8 - mode
	thermograph5 - mode
	Star1 - direction
	Star4 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Star3 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 infrared6)
	(calibration_target instrument0 Star3)
	(supports instrument1 infrared7)
	(supports instrument1 thermograph5)
	(calibration_target instrument1 Star4)
	(supports instrument2 spectrograph8)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument3 image0)
	(supports instrument3 spectrograph8)
	(supports instrument3 infrared6)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 image1)
	(supports instrument4 infrared6)
	(supports instrument4 image2)
	(calibration_target instrument4 Star3)
	(supports instrument5 image1)
	(supports instrument5 infrared3)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument6 infrared3)
	(supports instrument6 infrared7)
	(calibration_target instrument6 Star3)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon6)
)
(:goal (and
	(pointing satellite0 GroundStation2)
	(pointing satellite1 Star1)
	(pointing satellite2 Planet9)
	(have_image Phenomenon5 infrared7)
	(have_image Phenomenon5 infrared6)
	(have_image Phenomenon6 spectrograph4)
	(have_image Phenomenon7 image1)
	(have_image Phenomenon7 image0)
	(have_image Phenomenon7 thermograph5)
	(have_image Star8 infrared6)
	(have_image Planet9 infrared7)
	(have_image Planet9 spectrograph8)
	(have_image Planet9 infrared3)
	(have_image Phenomenon10 thermograph5)
	(have_image Phenomenon10 infrared3)
	(have_image Star11 spectrograph8)
	(have_image Star11 infrared7)
	(have_image Star11 thermograph5)
))

)

; plan
1. (turn_to satellite1 groundstation2 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 18
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 18
3. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 0 of 18
4. (turn_to satellite1 star11 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star11)
   goals met: 0 of 18
5. (take_image satellite1 star11 instrument3 spectrograph8)
   added: (have_image star11 spectrograph8)
   goals met: 1 of 18
6. (turn_to satellite1 planet9 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 planet9)
   goals met: 1 of 18
7. (take_image satellite1 planet9 instrument3 spectrograph8)
   added: (have_image planet9 spectrograph8)
   goals met: 2 of 18
8. (turn_to satellite1 phenomenon7 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 phenomenon7)
   goals met: 2 of 18
9. (take_image satellite1 phenomenon7 instrument3 image0)
   added: (have_image phenomenon7 image0)
   goals met: 3 of 18
10. (turn_to satellite1 phenomenon5 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon5)
   goals met: 3 of 18
11. (take_image satellite1 phenomenon5 instrument3 infrared6)
   added: (have_image phenomenon5 infrared6)
   goals met: 4 of 18
12. (turn_to satellite1 groundstation0 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 groundstation0)
   goals met: 4 of 18
13. (turn_to satellite0 star3 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star3)
   goals met: 4 of 18
14. (switch_off instrument3 satellite1)
   deleted: (power_on instrument3)
   added: (power_avail satellite1)
   goals met: 4 of 18
15. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 4 of 18
16. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 18
17. (calibrate satellite1 instrument5 groundstation0)
   added: (calibrated instrument5)
   goals met: 4 of 18
18. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 4 of 18
19. (turn_to satellite0 phenomenon6 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 18
20. (take_image satellite0 phenomenon6 instrument0 spectrograph4)
   added: (have_image phenomenon6 spectrograph4)
   goals met: 5 of 18
21. (turn_to satellite0 star8 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star8)
   goals met: 5 of 18
22. (take_image satellite0 star8 instrument0 infrared6)
   added: (have_image star8 infrared6)
   goals met: 6 of 18
23. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 6 of 18
24. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 6 of 18
25. (turn_to satellite0 star4 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star4)
   goals met: 6 of 18
26. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 6 of 18
27. (turn_to satellite0 phenomenon10 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon10)
   goals met: 6 of 18
28. (take_image satellite0 phenomenon10 instrument1 thermograph5)
   added: (have_image phenomenon10 thermograph5)
   goals met: 7 of 18
29. (turn_to satellite0 phenomenon5 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon5)
   goals met: 7 of 18
30. (take_image satellite0 phenomenon5 instrument1 infrared7)
   added: (have_image phenomenon5 infrared7)
   goals met: 8 of 18
31. (turn_to satellite0 phenomenon7 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon7)
   goals met: 8 of 18
32. (take_image satellite0 phenomenon7 instrument1 thermograph5)
   added: (have_image phenomenon7 thermograph5)
   goals met: 9 of 18
33. (turn_to satellite0 planet9 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet9)
   goals met: 9 of 18
34. (take_image satellite0 planet9 instrument1 infrared7)
   added: (have_image planet9 infrared7)
   goals met: 10 of 18
35. (turn_to satellite0 star11 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star11)
   goals met: 10 of 18
36. (take_image satellite0 star11 instrument1 infrared7)
   added: (have_image star11 infrared7)
   goals met: 11 of 18
37. (take_image satellite0 star11 instrument1 thermograph5)
   added: (have_image star11 thermograph5)
   goals met: 12 of 18
38. (turn_to satellite0 groundstation2 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation2)
   goals met: 13 of 18
39. (turn_to satellite1 phenomenon10 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon10)
   goals met: 13 of 18
40. (take_image satellite1 phenomenon10 instrument5 infrared3)
   added: (have_image phenomenon10 infrared3)
   goals met: 14 of 18
41. (turn_to satellite1 phenomenon7 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon7)
   goals met: 14 of 18
42. (take_image satellite1 phenomenon7 instrument5 image1)
   added: (have_image phenomenon7 image1)
   goals met: 15 of 18
43. (turn_to satellite1 planet9 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet9)
   goals met: 15 of 18
44. (take_image satellite1 planet9 instrument5 infrared3)
   added: (have_image planet9 infrared3)
   goals met: 16 of 18
45. (turn_to satellite1 star1 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star1)
   goals met: 17 of 18
46. (turn_to satellite2 planet9 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 planet9)
   goals met: 18 of 18
